# UNIDADE 1

## AULA 1

In [1]:
import pandas as pandas

In [2]:
dados = pandas.read_csv('dados/aluguel.csv',sep = ';')

In [3]:
type(dados)
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

In [4]:
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

## AULA 2 -  INFORMAÇÕES GERAIS

In [5]:
tipos_de_dados = pandas.DataFrame(dados.dtypes, columns = ['Tipo'])
# tipos das variáveis

In [6]:
tipos_de_dados.columns.name = "Variáveis"

In [7]:
tipos_de_dados

Variáveis      Tipo
Tipo         object
Bairro       object
Quartos       int64
Vagas         int64
Suites        int64
Area          int64
Valor       float64
Condominio  float64
IPTU        float64

In [8]:
dados.shape

(32960, 9)

In [9]:
print('A base de dados tem {} registros (imóveis) e {} variáveis'.format(dados.shape[0], dados.shape[1]))

A base de dados tem 32960 registros (imóveis) e 9 variáveis

# Unidade 2

## Aula 1-  Tipos de imóveis

In [10]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000.0,19193.0,3030.0

In [11]:
tipos_de_imovel = dados['Tipo']
tipos_de_imovel.drop_duplicates(inplace = True)
# inplace é o que faz o método excluir dentro da variável e torná-la editada

## Aula 2 - Organizando a visualização

In [12]:
tipos_de_imovel = pandas.DataFrame(tipos_de_imovel)
tipos_de_imovel.index

Int64Index([    0,     1,     2,     3,     7,    16,    17,    29,    80,
               83,   117,   159,   207,   347,   589,  2157,  3354,  4379,
             4721,  6983,  9687, 23614],
           dtype='int64')

In [13]:
tipos_de_imovel.shape[0] 
# tamanho do DataFrame

22

In [14]:
range(tipos_de_imovel.shape[0])

range(0, 22)

In [15]:
tipos_de_imovel.index = range(tipos_de_imovel.shape[0])
tipos_de_imovel.columns.name = 'ID'

In [16]:
tipos_de_imovel

ID                         Tipo
0                     Quitinete
1                          Casa
2       Conjunto Comercial/Sala
3                   Apartamento
4            Casa de Condomínio
5                Prédio Inteiro
6                          Flat
7                    Loja/Salão
8       Galpão/Depósito/Armazém
9                Casa Comercial
10                 Casa de Vila
11               Terreno Padrão
12                  Box/Garagem
13                         Loft
14  Loja Shopping/ Ct Comercial
15                      Chácara
16        Loteamento/Condomínio
17                        Sítio
18                Pousada/Chalé
19                       Studio
20                        Hotel
21                    Indústria

# UNIDADE 3

## Aula 1 - imóveis residenciais

In [17]:
dados = pandas.read_csv('dados/aluguel.csv',sep = ';')

In [18]:
list(dados['Tipo'].drop_duplicates())

['Quitinete',
 'Casa',
 'Conjunto Comercial/Sala',
 'Apartamento',
 'Casa de Condomínio',
 'Prédio Inteiro',
 'Flat',
 'Loja/Salão',
 'Galpão/Depósito/Armazém',
 'Casa Comercial',
 'Casa de Vila',
 'Terreno Padrão',
 'Box/Garagem',
 'Loft',
 'Loja Shopping/ Ct Comercial',
 'Chácara',
 'Loteamento/Condomínio',
 'Sítio',
 'Pousada/Chalé',
 'Studio',
 'Hotel',
 'Indústria']

In [19]:
residencial = ['Quitinete',
               'Casa',
               'Apartamento',
               'Casa de Condomínio',
               'Casa de Vila']

In [20]:
selecao = dados['Tipo'].isin(residencial)
#conferência booleana dos valores da variável atraves de .head()

In [21]:
dados_residencial = dados[selecao]
dados_residencial.shape[0]
#list(dados_residencial['Tipo'].drop_duplicates())
#a lista de seleção pode ser uma variável tratada

22580

In [22]:
dados_residencial.index = range(dados_residencial.shape[0])

## Aula 2 - exportando bases de dados

In [23]:
dados_residencial.to_csv('dados/aluguel_residencial.csv', sep = ';', index = False)
# o index automatico pode ser cancelado

# Unidade 4

## Aula 1 - Seleções e frequências

##### Selecione somente os imóveis classificados com tipo 'Apartamento'.
##### Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.
##### Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.
##### Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.

In [24]:
dados_sf = pandas.read_csv('dados/aluguel_residencial.csv', sep = ';')
dados_sf.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN

In [25]:
##### 1.Selecione somente os imóveis classificados com tipo 'Apartamento'.
selecao_sf1 = dados_sf['Tipo' ] == 'Apartamento'
ssf1 = dados_sf[selecao_sf1].shape[0]
ssf1

19532

In [26]:
##### 2.Selecione os imóveis classificados com tipos 'Casa', 'Casa de Condomínio' e 'Casa de Vila'.
selecao_sf2 =  (dados_sf['Tipo'] == 'Casa')|(dados_sf['Tipo'] == 'Casa de Condomínio')|(dados_sf['Tipo'] == 'Casa de Vila')
ssf2 = dados_sf[selecao_sf2].shape[0]
ssf2

2212

In [27]:
##### 3.Selecione os imóveis com área entre 60 e 100 metros quadrados, incluindo os limites.
##### 60 <= area <= 100
selecao_sf3 = (dados_sf['Area'] >= 60) & (dados_sf['Area'] <= 100)
ssf3 = dados_sf[selecao_sf3].shape[0]
ssf3

8719

In [28]:
##### 4.Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00.
selecao_sf4 = (dados_sf['Quartos'] >= 4) & (dados_sf['Valor'] < 2000)
ssf4 = dados_sf[selecao_sf4].shape[0]
ssf4

41

In [29]:
#####Repostas
print('Primeira:{}'.format(ssf1))
print('Segunda:{}'.format(ssf2))
print('Terceira:{}'.format(ssf3))
print('Quarta:{}'.format(ssf4))

Primeira:19532
Segunda:2212
Terceira:8719
Quarta:41

## EXERCÍCIOS

In [30]:
alunos = pandas.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6], 
                        'Aprovado': [True, False, False, True, True, True, False, False]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas', 'Aprovado'])

In [31]:
##### 1.Crie um DataFrame somente com os alunos aprovados.
ap1 = alunos['Aprovado'] == True
aprovados = alunos[ap1]
aprovados

    Nome  Idade Sexo  Notas  Aprovado
0    Ary     15    M    7.5      True
3   Beto     32    M   10.0      True
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [32]:
##### 2.Crie um DataFrame somente com as alunas aprovadas.
ap2 = (alunos['Aprovado'] == True) & (alunos['Sexo'] == 'F')
aprovadas_mulheres = alunos[ap2]
aprovadas_mulheres

    Nome  Idade Sexo  Notas  Aprovado
4  Bruna     42    F    8.2      True
5   Dara     21    F    7.0      True

In [33]:
##### 3.Crie apenas uma visualização dos alunos com idade entre 10 e 20 anos ou com idade maior ou igual a 40 anos.
ap3 = (alunos['Idade'] > 10) & (alunos['Idade'] < 20) | (alunos['Idade'] >= 40)
repo3 = alunos[ap3]
repo3

     Nome  Idade Sexo  Notas  Aprovado
0     Ary     15    M    7.5      True
2   Denis     56    M    5.0     False
4   Bruna     42    F    8.2      True
6  Carlos     19    M    6.0     False

In [34]:
##### 4.Crie um DataFrame somente com os alunos reprovados e 
##### mantenha neste DataFrame apenas as colunas Nome, Sexo e Idade, nesta ordem.
ap4= (alunos['Aprovado'] == False)
reprovados = alunos[['Nome','Idade','Sexo']][ap4]
reprovados
##### as colunas selecionadas + variáveis em parâmetros separados

     Nome  Idade Sexo
1   Cátia     27    F
2   Denis     56    M
6  Carlos     19    M
7   Alice     35    F

In [47]:
##### Crie uma visualização com os três alunos mais novos.
alunos.

SyntaxError: positional argument follows keyword argument (<ipython-input-47-f2f6d399e72a>, line 2)